# Task 1: how to read all sheets of excel file using pandas

In [1]:
import pandas as pd
#Read all sheets in the Excel file
sheets = pd.read_excel('Pandas/data.xlsx', sheet_name=None)
sheets

{'Sheet1':    id   name  age
 0   1  mario   24
 1   2  mayer   22
 2   3  basma   21,
 'Sheet2':    a   b    c
 0  1  10  100
 1  2  20  200
 2  3  30  300,
 'Sheet3':    w  x  y
 0  1  4  7
 1  2  5  8
 2  3  6  9}

# Task 2: How to read random rows from our data

#### Method 1: Using the sample Method

In [2]:
df = pd.read_csv("Pandas/stock_data-4.csv")

# Select 4 random rows
sample_df = df.sample(n=4)
sample_df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

#### Method 2: Using the numpy

In [7]:
import numpy as np

df = pd.read_csv("Pandas/stock_data-4.csv")

# Generate an array of random indices
random_indices = np.random.randint(0, len(df), size=4)

# Select the corresponding rows
random_rows = df.iloc[random_indices]
random_rows

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata
2    MSFT             -1       85    64     bill gates

# Task 3: save 2 columns, last 3 rows only

In [3]:
import pandas as pd
df = pd.read_csv("Pandas/newcolumns-4-Copy1.csv") # file contain 5 rows , 2 columns
columns_to_write = ['tickers','price']  # 2 columns
rows_to_write = [2,3,4] # last 3 rows
df_selected = df.loc[rows_to_write, columns_to_write]
# make new file to save on it the 2 columns, last 3 rows only and if we want to save in the same file that have all data 
# we will write the file name  ---> newcolumns-4-Copy1.csv
df_selected.to_csv("newcolumns-4-Copy.csv", columns=["tickers","price"], index=False)
df_selected

  tickers price
2    MSFT    64
3    RIL   1023
4    TATA  n.a.

# Task 4: how to append to an existing csv file or excel file same sheet

## Appending to a CSV file:

In [5]:
import pandas as pd   
existing_data = pd.read_csv("existing_file.csv") # existing file contain 4 rows & 4 columns 
new_data = pd.DataFrame({'EST': ['1/5/2016','1/6/2016','1/7/2016'], 'Temperature': [20,33,39],'DewPoint': [-3,4,11],
                         'Humidity': [41,35,33]})
appended_data = pd.concat([existing_data, new_data], ignore_index=True)
appended_data.to_csv("existing_file.csv", index=False) # existing file contain 7 rows & 4 columns 
existing_data

        EST  Temperature  DewPoint  Humidity
0  1/1/2016           38        23        52
1  1/2/2016           36        18        46
2  1/3/2016           40        21        47
3  1/4/2016           25         9        44
4  1/5/2016           20        -3        41
5  1/6/2016           33         4        35
6  1/7/2016           39        11        33

## Appending to an Excel file in the same sheet:

In [13]:
import pandas as pd
from openpyxl import load_workbook
existing_data = pd.read_excel("Pandas/existing_file1.xlsx", sheet_name="Sheet1")
new_data = pd.DataFrame({'EST': ['1/5/2016','1/6/2016','1/7/2016'], 'Temperature': [20,33,39],'DewPoint': [-3,4,11],
                         'Humidity': [41,35,33]})
appended_data = pd.concat([existing_data, new_data], ignore_index=True)
with pd.ExcelWriter("Pandas/existing_file1.xlsx") as writer:
    appended_data.to_excel(writer, sheet_name="Sheet1", index=False)
existing_data

  EST         Temperature  DewPoint  Humidity       EST
0 2016-01-01           38        23        52       NaN
1 2016-01-02           36        18        46       NaN
2 2016-01-03           40        21        47       NaN
3 2016-01-04           25         9        44       NaN
4        NaT           20        -3        41  1/5/2016
5        NaT           33         4        35  1/6/2016
6        NaT           39        11        33  1/7/2016

# Task 5: replace data in specific columns with specific values

In [9]:
import pandas as pd
df = pd.DataFrame({
    'student': ['rob', 'maya', 'parthiv', 'tom', 'julian', 'erica'],
    'departement': ['CS', 'IS', 'IT', 'AI', 'BIO', 'DS'],
    'score': ['exceptional','average', 'good', 'poor', 'average', 'exceptional'],
    'level': [1, 2, 4, 3, 2, 4]
})
df

   student departement        score  level
0      rob          CS  exceptional      1
1     maya          IS      average      2
2  parthiv          IT         good      4
3      tom          AI         poor      3
4   julian         BIO      average      2
5    erica          DS  exceptional      4

In [19]:
df.replace({'student': 'maya', 'departement': 'DS'},
           {'student': 'mayar', 'departement':'CS'},
           inplace=True)
df

   student departement      score  level
0      rob          CS  very good      1
1    mayar          IS    average      2
2  parthiv          IT       good      4
3      tom          AI       poor      3
4   julian         BIO    average      2
5    erica          CS  very good      4

In [20]:
df.loc[df['score'] == 'exceptional', 'score'] = 'very good'
df

   student departement      score  level
0      rob          CS  very good      1
1    mayar          IS    average      2
2  parthiv          IT       good      4
3      tom          AI       poor      3
4   julian         BIO    average      2
5    erica          CS  very good      4

In [21]:
# Replace values based on a condition in a specific column
df.loc[df['score'] == 'poor', 'level'] = df.level-1
df

   student departement      score  level
0      rob          CS  very good      1
1    mayar          IS    average      2
2  parthiv          IT       good      4
3      tom          AI       poor      2
4   julian         BIO    average      2
5    erica          CS  very good      4

# Task 6: How to detect and remove outliers using pandas

In [26]:
# Interquartile Range (IQR) Method to detect outliers
import pandas as pd

# Create a sample DataFrame
data = {'A': [1, 2, 3, 4, 5, 30],
        'B': [6, 7, 8, 9, 10, 50],
        'C': [11, 12, 13, 14, 15, 60]}


df = pd.DataFrame(data)

# Calculate the first quartile (Q1) and third quartile (Q3)
Q1 = df.quantile(0.25)
Q3 = df.quantile(0.75)

# Calculate the interquartile range (IQR)
IQR = Q3 - Q1

# Define a threshold for outlier detection (e.g., 1.5 times the IQR)
threshold = 1.5

# Find the indices of outliers
outlier_indices = ((df < (Q1 - threshold * IQR)) | (df > (Q3 + threshold * IQR))).any(axis=1)

# Remove outliers from the DataFrame
df_without_outliers = df[~outlier_indices]

print(df_without_outliers)

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

# Task 7: What is lambda expression?

### Lambda functions are similar to user-defined functions but without a name. They're commonly referred to as anonymous functions.
How to Define a Lambda Function:

lambda argument(s) : expression

--> lambda is a keyword in Python for defining the anonymous function.

--> argument(s) is a placeholder, that is a variable that will be used to hold the value you want to pass into the function expression. A lambda function can have multiple variables depending on what you want to achieve.

--> expression is the code you want to execute in the lambda function.

The anonymous function does not have a return keyword. This is because the anonymous function will automatically return the result of the expression in the function once it is executed.

EX: lambda x: x % 2 == 0

# Task 8: How to sort dateframe by index and how to sort dataframe by specific column?

In [34]:
import pandas as pd

temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[4,5,2])

windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])

df = pd.concat([temperature_df,windspeed_df])
df

       city  temperature  windspeed
4    mumbai         32.0        NaN
5     delhi         45.0        NaN
2  banglore         30.0        NaN
1     delhi          NaN        7.0
0    mumbai          NaN       12.0

### Sort DataFrame by index

In [37]:
# sort the index in ascending order
df_sorted_by_index = df.sort_index()
df_sorted_by_index

       city  temperature  windspeed
0    mumbai          NaN       12.0
1     delhi          NaN        7.0
2  banglore         30.0        NaN
4    mumbai         32.0        NaN
5     delhi         45.0        NaN

In [36]:
# To sort the index in descending order, you can pass the ascending=False parameter:
df_sorted_by_index = df.sort_index(ascending=False)
df_sorted_by_index

       city  temperature  windspeed
5     delhi         45.0        NaN
4    mumbai         32.0        NaN
2  banglore         30.0        NaN
1     delhi          NaN        7.0
0    mumbai          NaN       12.0

### Sort a DataFrame by a specific column

In [32]:
# Sort DataFrame by a specific column in ascending order
df_sorted_by_column = df.sort_values('city')
df_sorted_by_column

       city  temperature  windspeed
2  banglore         30.0        NaN
5     delhi         45.0        NaN
1     delhi          NaN        7.0
4    mumbai         32.0        NaN
0    mumbai          NaN       12.0

In [38]:
# Sort DataFrame by a specific column in descending order
df_sorted_by_column = df.sort_values('city',ascending=False )
df_sorted_by_column

       city  temperature  windspeed
4    mumbai         32.0        NaN
0    mumbai          NaN       12.0
5     delhi         45.0        NaN
1     delhi          NaN        7.0
2  banglore         30.0        NaN

# Task 9: how to combine more than 2 dataframes at the same time

In [45]:
# three dataframes have different columns
import pandas as pd
df1 = pd.DataFrame({
    "a": [1,2,3,4,5],
    "b": [6,7,8,9,10],
})
df2 = pd.DataFrame({
    "c": [11,12,13,14,15],
    "d": [16,17,18,19,20],
})
df3 = pd.DataFrame({
    "e": [21,22,23,24,25],
    "f": [26,27,28,29,30],
})
# Define a list of DataFrames
dfs = [df1, df2, df3]

# Combine DataFrames using pd.concat()
combined_df = pd.concat(dfs, axis=1)

combined_df

   a   b   c   d   e   f
0  1   6  11  16  21  26
1  2   7  12  17  22  27
2  3   8  13  18  23  28
3  4   9  14  19  24  29
4  5  10  15  20  25  30

In [43]:
# three dataframes have same columns
import pandas as pd
df1 = pd.DataFrame({
    "a": [1,2,3,4,5],
    "b": [6,7,8,9,10],
})
df2 = pd.DataFrame({
    "a": [11,12,13,14,15],
    "b": [16,17,18,19,20],
})
df3 = pd.DataFrame({
    "a": [21,22,23,24,25],
    "b": [26,27,28,29,30],
})
# Define a list of DataFrames
dfs = [df1, df2, df3]

# Combine DataFrames using pd.concat()
combined_df = pd.concat(dfs,ignore_index=True)

combined_df

     a   b
0    1   6
1    2   7
2    3   8
3    4   9
4    5  10
5   11  16
6   12  17
7   13  18
8   14  19
9   15  20
10  21  26
11  22  27
12  23  28
13  24  29
14  25  30